m1 = """Perplexity 是機器學習中常用來評估語言模型性能的一種指標。它表示給定模型的訓練資料，模型預測出的每個字符 (或是詞彙) 的不確定性。Perplexity 越低，代表模型的預測越準確。
"""

m2 = """你好！設計連續低通濾波器的一種方法是使用 z 多項式展開的分子分母係數。

首先，你需要确定你希望濾波器具有的特性，例如截止頻率、阻帶寬度和通帶過渡帶的斜率。然后，你可以使用濾波器設計工具或手動設計濾波器，以獲得滿足你需求的濾波器類型。

一旦你確定了濾波器類型，你可以使用 z 多項式展開的分子分母係數來描述濾波器的響應。這種方法將濾波器的響應表示為一個分子多項式和一個分母多項式的形式，並使用 z 變量表示時域信號在傅立葉空間中的表示。

例如，考慮一個二項式低通濾波器，其分子分母係數可以表示為：

H(z) = (b0 + b1z^(-1) + b2z^(-2)) / (1 + a1z^(-1) + a2z^(-2))

在這個例子中，b0、b1 和 b2 是分子多項式的系數，而 a1 和 a2 是分母多項式的系數。通過調整這些系數，你可以控制濾波器的特性，使其符合你的需求。

希望這對你有所幫助！
"""

m3 = """寫好項目經驗的方法有以下幾點:

明確顯示項目的目標和成果: 要說明項目的目標是什麼，以及你是如何達成這些目標的。

說明你的責任和貢獻: 要清楚地說明你在項目中扮演的角色，以及你的貢獻是什麼。

使用具體的數據和指標來支持你的說明: 例如，如果你在項目中提高了銷售額，請提供具體的數字。

使用技能關鍵字: 確保在描述項目經驗時使用與你申請的職位相關的技能關鍵字。

保持簡潔明了: 要保持簡潔明了，避免冗長的描述。

項目經驗最好是寫成故事的形式，用「我為項目做了什麼」「遇到了什麼困難」「如何解決」「得到了什麼成效」的方式，讓面試官能夠更深入的了解你的能力。
"""

m4 = """在這種情況下，相對路徑是相對於當前工作目錄 (即包含你執行腳本的資料夾) 而言的。

另外，你也可以使用 PYTHONPATH 環境變數來匯入資料夾中的檔案。你可以在你的系統中設定 PYTHONPATH 環境變數，使得 Python 可以在執行時自動搜尋資料夾中的模組和函式庫。例如:
"""

m6 = """可以使用 Python 的 unittest 模組來寫測試 API 載入時間的單元測試。

首先，您需要安裝 unittest 模組，如果您使用的是 Python 的最新版本，unittest 模組已經隨附於 Python 內建的模組中，您可以直接導入。如果您使用的是舊版本的 Python，可以使用 pip 安裝：
"""

m5 = """台灣是一個位於東亞的島嶼國家，首都為台北。台灣具有豐富的文化和歷史，也是一個重要的經濟體，在電子產品和科技領域有很高的地位。
"""

h1 = """這群孩子不簡單，曾經在設計這些課程時，會擔心這些孩子究竟能不能如期完成這些作業，會不會負擔太重，會不會嚇跑他們...因為我們在五天內要他們生出一齣短劇、一趟花蓮的旅遊規劃、一個屬於自己的網頁，還要用英文來推理事件真相、進行學測五選四、夢想還是現實重要等議題辯論，以及台灣大車隊及雲端的個案競賽，五天的時間要負擔這麼多的作業量，可能連許多大學生都沒辦法承受的住，但這些孩子都順利完成這些作業了!!品質也都有在水準之上，真的很不簡單。我想對這群孩子說，不管這五天的營隊是否有幫你們找到未來升學方向，這次營隊結束後你們的基本素質一定能提升不少，在你們之中，也許有些人不擅長和人討論，不擅長上台報告，不擅長觀察他人，不擅長包容他人的意見...現在，這些你原有的不足已不再是你的缺點，記住這五天的衝勁，一鼓作氣地奔向你的目標吧！
"""

h2 = """說個小故事好了，19世紀時，有位名為哈代的數學家，因為怕自己在搭船前往英國時會遇難（從丹麥搭到英國要橫越幾百公里）。
所以他就寄了封信給他朋友，上面只有一句話「我已經證明了黎曼猜想。」
果然老天爺沒捨得讓他的小船沉沒。
"""

h3 = """複分析在財金與經濟領域上比較沒有直接的應用
至少在我認知中,沒什麼比較著名的定理
"""

h4 = """對未來的人生感到迷惘嗎？
交不到女友還在迷失方向的你
讓達摩大師開釋吧！
達摩籤機即將出現在明天的夏日市集！
還可以免費玩傳說中 的復古遊戲街機！！
"""

h5 = """身為台北人，我真的很窮，可不可以請大家donate我?
"""

h6 = """「十里坡劍神」其真人是台灣的一位仙劍玩家，網名「bill7437」。

2005年11月的一天，眾人在批踢踢論壇上回憶當年玩《仙劍奇俠傳》的情景，他發帖感嘆道：

談到仙劍一，這還真是一款老遊戲了。
你愛唱歌我愛笑，喔不，是年幼無知什麼都不懂，仙劍是我接觸的第一款RPG遊戲，那時候還以為這是有對話的格鬥遊戲，我根本沒想過有劇情進展這一回事，以為故事在漁村就到了尾聲。

（好啦我承認我找不到船出發啦，我怎知要搭客船非漁船。）

於是每回開了遊戲，就在同一個地圖打怪，那地圖點想必大家耳熟能詳，李逍遙老家旁的十里坡是也。

打著打著只覺得遊戲越來越無聊，怪越來越好打，只是家裡只有表哥給的這款遊戲，也只好將就著用啦。

不久無意中發現等級高了可以有新招式，於此對打怪練級多了分期待，對華麗畫面的期待。

可是這樣玩了很久還是會膩的，尤其是當新招式遲遲不見時，而砍怪的單體攻擊還比劍神強時。

等到後來我知道要搭客船繼續遊戲，我李逍遙已經71級了……還來，我半年的光陰啊！！！
"""

h7 = """Roger真的是不知道在做什麼東西，跑去英國念書就算惹
還忘記幫我買飲料
"""